{
     "@odata.type": "#microsoft.graph.iosCompliancePolicy",
     "roleScopeTagIds": [
          "0"
     ],
     "description": "",
     "displayName": "Contoso MDM Compliance Policy for iOS",
     "passcodeBlockSimple": false,
     "passcodeExpirationDays": null,
     "passcodeMinimumLength": 4,
     "passcodeMinutesOfInactivityBeforeLock": null,
     "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
     "passcodePreviousPasscodeBlockCount": null,
     "passcodeMinimumCharacterSetCount": null,
     "passcodeRequiredType": "numeric",
     "passcodeRequired": true,
     "osMinimumVersion": null,
     "osMaximumVersion": null,
     "osMinimumBuildVersion": null,
     "osMaximumBuildVersion": null,
     "securityBlockJailbrokenDevices": true,
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "managedEmailProfileRequired": false,
     "restrictedApps": [],
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "sg-Sales and Marketing",
                    "groupType": "StaticMembership"
               }
          }
     ]
}