{
     "displayName": "Modern Workplace DSS Policy [Windows 11]",
     "description": "Windows 11 DSS Policy",
     "featureUpdateVersion": "Windows 10, version 21H2",
     "roleScopeTagIds": [
          "0"
     ],
     "deployableContentDisplayName": null,
     "endOfSupportDate": "2024-06-11T00:00:00Z",
     "installLatestWindows10OnWindows11IneligibleDevice": false,
     "rolloutSettings": {
          "offerStartDateTimeInUTC": null,
          "offerEndDateTimeInUTC": null,
          "offerIntervalInDays": null
     },
     "assignments": [
          {
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace - Windows 11 Pre-Release Test Devices",
                    "groupType": "StaticMembership"
               }
          }
     ]
}