{
     "@odata.type": "#microsoft.graph.iosGeneralDeviceConfiguration",
     "roleScopeTagIds": [
          "0"
     ],
     "deviceManagementApplicabilityRuleOsEdition": null,
     "deviceManagementApplicabilityRuleOsVersion": null,
     "deviceManagementApplicabilityRuleDeviceMode": null,
     "description": "11242023T1851",
     "displayName": "iOS device restriction to block Game Center",
     "accountBlockModification": false,
     "activationLockAllowWhenSupervised": false,
     "airDropBlocked": false,
     "airDropForceUnmanagedDropTarget": false,
     "airPlayForcePairingPasswordForOutgoingRequests": false,
     "appleWatchBlockPairing": false,
     "appleWatchForceWristDetection": false,
     "appleNewsBlocked": false,
     "appsVisibilityListType": "none",
     "appStoreBlockAutomaticDownloads": false,
     "appStoreBlocked": false,
     "appStoreBlockInAppPurchases": false,
     "appStoreBlockUIAppInstallation": false,
     "appStoreRequirePassword": false,
     "autoFillForceAuthentication": false,
     "bluetoothBlockModification": false,
     "cameraBlocked": false,
     "cellularBlockDataRoaming": false,
     "cellularBlockGlobalBackgroundFetchWhileRoaming": false,
     "cellularBlockPerAppDataModification": false,
     "cellularBlockPersonalHotspot": false,
     "cellularBlockPlanModification": false,
     "cellularBlockVoiceRoaming": false,
     "certificatesBlockUntrustedTlsCertificates": false,
     "classroomAppBlockRemoteScreenObservation": false,
     "classroomAppForceUnpromptedScreenObservation": false,
     "classroomForceAutomaticallyJoinClasses": false,
     "classroomForceUnpromptedAppAndDeviceLock": false,
     "compliantAppListType": "none",
     "configurationProfileBlockChanges": false,
     "definitionLookupBlocked": false,
     "deviceBlockEnableRestrictions": false,
     "deviceBlockEraseContentAndSettings": false,
     "deviceBlockNameModification": false,
     "diagnosticDataBlockSubmission": false,
     "diagnosticDataBlockSubmissionModification": false,
     "documentsBlockManagedDocumentsInUnmanagedApps": false,
     "documentsBlockUnmanagedDocumentsInManagedApps": false,
     "emailInDomainSuffixes": [],
     "enterpriseAppBlockTrust": false,
     "enterpriseAppBlockTrustModification": false,
     "esimBlockModification": false,
     "faceTimeBlocked": false,
     "findMyFriendsBlocked": false,
     "gamingBlockGameCenterFriends": false,
     "gamingBlockMultiplayer": false,
     "gameCenterBlocked": false,
     "hostPairingBlocked": false,
     "iBooksStoreBlocked": false,
     "iBooksStoreBlockErotica": false,
     "iCloudBlockActivityContinuation": false,
     "iCloudBlockBackup": false,
     "iCloudBlockDocumentSync": false,
     "iCloudBlockManagedAppsSync": false,
     "iCloudBlockPhotoLibrary": false,
     "iCloudBlockPhotoStreamSync": false,
     "iCloudBlockSharedPhotoStream": false,
     "iCloudRequireEncryptedBackup": false,
     "iTunesBlockExplicitContent": false,
     "iTunesBlockMusicService": false,
     "iTunesBlockRadio": false,
     "keyboardBlockAutoCorrect": false,
     "keyboardBlockDictation": false,
     "keyboardBlockPredictive": false,
     "keyboardBlockShortcuts": false,
     "keyboardBlockSpellCheck": false,
     "kioskModeAllowAssistiveSpeak": false,
     "kioskModeAllowAssistiveTouchSettings": false,
     "kioskModeAllowAutoLock": false,
     "kioskModeBlockAutoLock": false,
     "kioskModeAllowColorInversionSettings": false,
     "kioskModeAllowRingerSwitch": false,
     "kioskModeBlockRingerSwitch": false,
     "kioskModeAllowScreenRotation": false,
     "kioskModeBlockScreenRotation": false,
     "kioskModeAllowSleepButton": false,
     "kioskModeBlockSleepButton": false,
     "kioskModeAllowTouchscreen": false,
     "kioskModeBlockTouchscreen": false,
     "kioskModeEnableVoiceControl": false,
     "kioskModeAllowVoiceControlModification": false,
     "kioskModeAllowVoiceOverSettings": false,
     "kioskModeAllowVolumeButtons": false,
     "kioskModeBlockVolumeButtons": false,
     "kioskModeAllowZoomSettings": false,
     "kioskModeAppStoreUrl": null,
     "kioskModeBuiltInAppId": null,
     "kioskModeRequireAssistiveTouch": false,
     "kioskModeRequireColorInversion": false,
     "kioskModeRequireMonoAudio": false,
     "kioskModeRequireVoiceOver": false,
     "kioskModeRequireZoom": false,
     "kioskModeManagedAppId": null,
     "lockScreenBlockControlCenter": false,
     "lockScreenBlockNotificationView": false,
     "lockScreenBlockPassbook": false,
     "lockScreenBlockTodayView": false,
     "mediaContentRatingAustralia": null,
     "mediaContentRatingCanada": null,
     "mediaContentRatingFrance": null,
     "mediaContentRatingGermany": null,
     "mediaContentRatingIreland": null,
     "mediaContentRatingJapan": null,
     "mediaContentRatingNewZealand": null,
     "mediaContentRatingUnitedKingdom": null,
     "mediaContentRatingUnitedStates": null,
     "mediaContentRatingApps": "allAllowed",
     "messagesBlocked": false,
     "notificationsBlockSettingsModification": false,
     "passcodeBlockFingerprintUnlock": false,
     "passcodeBlockFingerprintModification": false,
     "passcodeBlockModification": false,
     "passcodeBlockSimple": false,
     "passcodeExpirationDays": null,
     "passcodeMinimumLength": null,
     "passcodeMinutesOfInactivityBeforeLock": null,
     "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
     "passcodeMinimumCharacterSetCount": null,
     "passcodePreviousPasscodeBlockCount": null,
     "passcodeSignInFailureCountBeforeWipe": null,
     "passcodeRequiredType": "deviceDefault",
     "passcodeRequired": false,
     "podcastsBlocked": false,
     "proximityBlockSetupToNewDevice": false,
     "safariBlockAutofill": false,
     "safariBlockJavaScript": false,
     "safariBlockPopups": false,
     "safariBlocked": false,
     "safariCookieSettings": "browserDefault",
     "safariManagedDomains": [],
     "safariPasswordAutoFillDomains": [],
     "safariRequireFraudWarning": false,
     "screenCaptureBlocked": false,
     "siriBlocked": false,
     "siriBlockedWhenLocked": false,
     "siriBlockUserGeneratedContent": false,
     "siriRequireProfanityFilter": false,
     "softwareUpdatesEnforcedDelayInDays": null,
     "softwareUpdatesForceDelayed": false,
     "spotlightBlockInternetResults": false,
     "voiceDialingBlocked": false,
     "wallpaperBlockModification": false,
     "wiFiConnectOnlyToConfiguredNetworks": false,
     "classroomForceRequestPermissionToLeaveClasses": false,
     "keychainBlockCloudSync": false,
     "pkiBlockOTAUpdates": false,
     "privacyForceLimitAdTracking": false,
     "enterpriseBookBlockBackup": false,
     "enterpriseBookBlockMetadataSync": false,
     "airPrintBlocked": false,
     "airPrintBlockCredentialsStorage": false,
     "airPrintForceTrustedTLS": false,
     "airPrintBlockiBeaconDiscovery": false,
     "filesNetworkDriveAccessBlocked": false,
     "filesUsbDriveAccessBlocked": false,
     "wifiPowerOnForced": false,
     "blockSystemAppRemoval": false,
     "vpnBlockCreation": false,
     "appRemovalBlocked": false,
     "usbRestrictedModeBlocked": false,
     "passwordBlockAutoFill": false,
     "passwordBlockProximityRequests": false,
     "passwordBlockAirDropSharing": false,
     "dateAndTimeForceSetAutomatically": false,
     "contactsAllowManagedToUnmanagedWrite": false,
     "contactsAllowUnmanagedToManagedRead": false,
     "cellularBlockPersonalHotspotModification": false,
     "continuousPathKeyboardBlocked": false,
     "findMyDeviceInFindMyAppBlocked": false,
     "findMyFriendsInFindMyAppBlocked": false,
     "iTunesBlocked": false,
     "sharedDeviceBlockTemporarySessions": false,
     "appClipsBlocked": false,
     "applePersonalizedAdsBlocked": false,
     "nfcBlocked": false,
     "autoUnlockBlocked": false,
     "unpairedExternalBootToRecoveryAllowed": false,
     "onDeviceOnlyDictationForced": false,
     "wiFiConnectToAllowedNetworksOnlyForced": false,
     "onDeviceOnlyTranslationForced": false,
     "managedPasteboardRequired": false,
     "iCloudPrivateRelayBlocked": false,
     "kioskModeAppType": "notConfigured",
     "appsSingleAppModeList": [],
     "appsVisibilityList": [],
     "compliantAppsList": [],
     "networkUsageRules": []
}