{
     "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
     "roleScopeTagIds": [
          "0"
     ],
     "deviceManagementApplicabilityRuleOsEdition": null,
     "deviceManagementApplicabilityRuleOsVersion": null,
     "deviceManagementApplicabilityRuleDeviceMode": null,
     "description": "Windows Update for Business Configuration for the Fast Ring",
     "displayName": "Windows Autopatch Update Policy - Default - Ring2",
     "deliveryOptimizationMode": "userDefined",
     "prereleaseFeatures": "userDefined",
     "automaticUpdateMode": "windowsDefault",
     "microsoftUpdateServiceAllowed": true,
     "driversExcluded": false,
     "qualityUpdatesDeferralPeriodInDays": 6,
     "featureUpdatesDeferralPeriodInDays": 0,
     "qualityUpdatesPaused": false,
     "featureUpdatesPaused": false,
     "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "businessReadyUpdatesOnly": "userDefined",
     "skipChecksBeforeRestart": false,
     "updateWeeks": null,
     "qualityUpdatesPauseStartDate": null,
     "featureUpdatesPauseStartDate": null,
     "featureUpdatesRollbackWindowInDays": 30,
     "qualityUpdatesWillBeRolledBack": null,
     "featureUpdatesWillBeRolledBack": null,
     "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "engagedRestartDeadlineInDays": null,
     "engagedRestartSnoozeScheduleInDays": null,
     "engagedRestartTransitionScheduleInDays": null,
     "deadlineForFeatureUpdatesInDays": 5,
     "deadlineForQualityUpdatesInDays": 2,
     "deadlineGracePeriodInDays": 2,
     "postponeRebootUntilAfterDeadline": false,
     "autoRestartNotificationDismissal": "notConfigured",
     "scheduleRestartWarningInHours": null,
     "scheduleImminentRestartWarningInMinutes": null,
     "userPauseAccess": "disabled",
     "userWindowsUpdateScanAccess": "enabled",
     "updateNotificationLevel": "notConfigured",
     "allowWindows11Upgrade": false,
     "installationSchedule": {
          "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall",
          "scheduledInstallDay": "everyday",
          "scheduledInstallTime": "03:00:00.0000000"
     },
     "assignments": [
          {
               "source": "direct",
               "intent": "apply",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Windows Autopatch - Ring2",
                    "groupType": "StaticMembership"
               }
          }
     ]
}