{
     "@odata.type": "#microsoft.graph.androidStoreApp",
     "displayName": "Adobe Acrobat Reader for Intune Android (Deprecated)",
     "publisher": "Adobe",
     "largeIcon": null,
     "isFeatured": false,
     "privacyInformationUrl": "",
     "informationUrl": null,
     "owner": "",
     "developer": "",
     "notes": "",
     "uploadState": 1,
     "publishingState": "published",
     "roleScopeTagIds": [],
     "dependentAppCount": 0,
     "supersedingAppCount": 0,
     "supersededAppCount": 0,
     "packageId": "com.adobe.reader.intune",
     "appIdentifier": "com.adobe.reader.intune",
     "appStoreUrl": "https://play.google.com/store/apps/details?id=com.adobe.reader.intune",
     "minimumSupportedOperatingSystem": {
          "v4_0": false,
          "v4_0_3": true,
          "v4_1": false,
          "v4_2": false,
          "v4_3": false,
          "v4_4": false,
          "v5_0": false,
          "v5_1": false,
          "v6_0": false,
          "v7_0": false,
          "v7_1": false,
          "v8_0": false,
          "v8_1": false,
          "v9_0": false,
          "v10_0": false,
          "v11_0": false
     },
     "assignments": [
          {
               "intent": "required",
               "settings": null,
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "sg-Sales and Marketing",
                    "groupType": "StaticMembership"
               }
          }
     ]
}