{
     "creationSource": "CloudManagedServices",
     "description": "Deploys Edge Stable Channel Updates. This policy is required by the Windows Autopatch service. Any changes you make to this policy will not be saved. Windows Autopatch will overwrite any changes.",
     "name": "Windows Autopatch - Edge Update Channel Stable",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "0"
     ],
     "settingCount": 1,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge",
                    "settingInstanceTemplateReference": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_part_targetchannel",
                                   "settingInstanceTemplateReference": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_part_targetchannel_stable",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-Fast",
                    "groupType": "StaticMembership"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-Broad",
                    "groupType": "StaticMembership"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-First",
                    "groupType": "StaticMembership"
               }
          }
     ]
}