{
     "creationSource": "CloudManagedServices",
     "description": "Sets MDM to win over GPO. This policy is required by the Windows Autopatch service. Any changes you make to this policy will not be saved. Windows Autopatch will overwrite any changes.",
     "name": "Windows Autopatch - MDM wins over GPO",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "0"
     ],
     "settingCount": 1,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_controlpolicyconflict_mdmwinsovergp",
                    "settingInstanceTemplateReference": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_controlpolicyconflict_mdmwinsovergp_1",
                         "children": []
                    }
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-Fast",
                    "groupType": "StaticMembership"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-Broad",
                    "groupType": "StaticMembership"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-First",
                    "groupType": "StaticMembership"
               }
          },
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "Modern Workplace Devices-Windows Autopatch-Test",
                    "groupType": "StaticMembership"
               }
          }
     ]
}