{
     "@odata.type": "#microsoft.graph.androidManagedAppProtection",
     "displayName": "Android apps data leak prevention policy",
     "description": "",
     "roleScopeTagIds": [
          "0"
     ],
     "periodOfflineBeforeAccessCheck": "PT12H",
     "periodOnlineBeforeAccessCheck": "PT30M",
     "allowedInboundDataTransferSources": "allApps",
     "allowedOutboundDataTransferDestinations": "managedApps",
     "organizationalCredentialsRequired": false,
     "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
     "dataBackupBlocked": true,
     "deviceComplianceRequired": true,
     "managedBrowserToOpenLinksRequired": true,
     "saveAsBlocked": true,
     "periodOfflineBeforeWipeIsEnforced": "P90D",
     "pinRequired": true,
     "maximumPinRetries": 5,
     "simplePinBlocked": false,
     "minimumPinLength": 4,
     "pinCharacterSet": "alphanumericAndSymbol",
     "periodBeforePinReset": "PT0S",
     "allowedDataStorageLocations": [
          "oneDriveForBusiness",
          "sharePoint"
     ],
     "contactSyncBlocked": false,
     "printBlocked": false,
     "fingerprintBlocked": false,
     "disableAppPinIfDevicePinIsSet": false,
     "maximumRequiredOsVersion": null,
     "maximumWarningOsVersion": null,
     "maximumWipeOsVersion": null,
     "minimumRequiredOsVersion": null,
     "minimumWarningOsVersion": null,
     "minimumRequiredAppVersion": null,
     "minimumWarningAppVersion": null,
     "minimumWipeOsVersion": null,
     "minimumWipeAppVersion": null,
     "appActionIfDeviceComplianceRequired": "block",
     "appActionIfMaximumPinRetriesExceeded": "block",
     "pinRequiredInsteadOfBiometricTimeout": null,
     "allowedOutboundClipboardSharingExceptionLength": 0,
     "notificationRestriction": "allow",
     "previousPinBlockCount": 0,
     "managedBrowser": "notConfigured",
     "maximumAllowedDeviceThreatLevel": "notConfigured",
     "mobileThreatDefenseRemediationAction": "block",
     "mobileThreatDefensePartnerPriority": null,
     "blockDataIngestionIntoOrganizationDocuments": false,
     "allowedDataIngestionLocations": [],
     "appActionIfUnableToAuthenticateUser": null,
     "dialerRestrictionLevel": "allApps",
     "gracePeriodToBlockAppsDuringOffClockHours": null,
     "protectedMessagingRedirectAppType": "anyApp",
     "targetedAppManagementLevels": "unspecified",
     "appGroupType": "selectedPublicApps",
     "screenCaptureBlocked": false,
     "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
     "encryptAppData": false,
     "minimumRequiredPatchVersion": "0000-00-00",
     "minimumWarningPatchVersion": "0000-00-00",
     "minimumWipePatchVersion": "0000-00-00",
     "allowedAndroidDeviceManufacturers": null,
     "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
     "appActionIfAccountIsClockedOut": null,
     "appActionIfSamsungKnoxAttestationRequired": null,
     "requiredAndroidSafetyNetDeviceAttestationType": "none",
     "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
     "requiredAndroidSafetyNetAppsVerificationType": "none",
     "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
     "customBrowserPackageId": null,
     "customBrowserDisplayName": null,
     "minimumRequiredCompanyPortalVersion": null,
     "minimumWarningCompanyPortalVersion": null,
     "minimumWipeCompanyPortalVersion": null,
     "keyboardsRestricted": false,
     "allowedAndroidDeviceModels": [],
     "appActionIfAndroidDeviceModelNotAllowed": "block",
     "customDialerAppPackageId": null,
     "customDialerAppDisplayName": null,
     "biometricAuthenticationBlocked": false,
     "requiredAndroidSafetyNetEvaluationType": "basic",
     "blockAfterCompanyPortalUpdateDeferralInDays": 0,
     "warnAfterCompanyPortalUpdateDeferralInDays": 0,
     "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
     "deviceLockRequired": false,
     "appActionIfDeviceLockNotSet": "block",
     "connectToVpnOnLaunch": false,
     "appActionIfDevicePasscodeComplexityLessThanLow": null,
     "appActionIfDevicePasscodeComplexityLessThanMedium": null,
     "appActionIfDevicePasscodeComplexityLessThanHigh": null,
     "requireClass3Biometrics": false,
     "requirePinAfterBiometricChange": false,
     "fingerprintAndBiometricEnabled": null,
     "messagingRedirectAppPackageId": null,
     "messagingRedirectAppDisplayName": null,
     "exemptedAppPackages": [
          {
               "name": "Default",
               "value": ""
          }
     ],
     "approvedKeyboards": [],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "sg-Sales and Marketing",
                    "groupType": "StaticMembership"
               }
          }
     ]
}