{
     "@odata.type": "#microsoft.graph.iosManagedAppProtection",
     "displayName": "iOS apps data leak prevention policy",
     "description": "",
     "roleScopeTagIds": [
          "0"
     ],
     "periodOfflineBeforeAccessCheck": "PT12H",
     "periodOnlineBeforeAccessCheck": "PT30M",
     "allowedInboundDataTransferSources": "allApps",
     "allowedOutboundDataTransferDestinations": "managedApps",
     "organizationalCredentialsRequired": false,
     "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
     "dataBackupBlocked": true,
     "deviceComplianceRequired": true,
     "managedBrowserToOpenLinksRequired": true,
     "saveAsBlocked": true,
     "periodOfflineBeforeWipeIsEnforced": "P90D",
     "pinRequired": true,
     "maximumPinRetries": 5,
     "simplePinBlocked": false,
     "minimumPinLength": 4,
     "pinCharacterSet": "alphanumericAndSymbol",
     "periodBeforePinReset": "PT0S",
     "allowedDataStorageLocations": [
          "oneDriveForBusiness",
          "sharePoint"
     ],
     "contactSyncBlocked": false,
     "printBlocked": false,
     "fingerprintBlocked": false,
     "disableAppPinIfDevicePinIsSet": false,
     "maximumRequiredOsVersion": null,
     "maximumWarningOsVersion": null,
     "maximumWipeOsVersion": null,
     "minimumRequiredOsVersion": null,
     "minimumWarningOsVersion": null,
     "minimumRequiredAppVersion": null,
     "minimumWarningAppVersion": null,
     "minimumWipeOsVersion": null,
     "minimumWipeAppVersion": null,
     "appActionIfDeviceComplianceRequired": "block",
     "appActionIfMaximumPinRetriesExceeded": "block",
     "pinRequiredInsteadOfBiometricTimeout": null,
     "allowedOutboundClipboardSharingExceptionLength": 0,
     "notificationRestriction": "allow",
     "previousPinBlockCount": 0,
     "managedBrowser": "notConfigured",
     "maximumAllowedDeviceThreatLevel": "notConfigured",
     "mobileThreatDefenseRemediationAction": "block",
     "mobileThreatDefensePartnerPriority": null,
     "blockDataIngestionIntoOrganizationDocuments": false,
     "allowedDataIngestionLocations": [],
     "appActionIfUnableToAuthenticateUser": null,
     "dialerRestrictionLevel": "allApps",
     "gracePeriodToBlockAppsDuringOffClockHours": null,
     "targetedAppManagementLevels": "unspecified",
     "appGroupType": "selectedPublicApps",
     "appDataEncryptionType": "whenDeviceLocked",
     "minimumRequiredSdkVersion": null,
     "faceIdBlocked": false,
     "minimumWipeSdkVersion": null,
     "allowedIosDeviceModels": null,
     "appActionIfIosDeviceModelNotAllowed": "block",
     "thirdPartyKeyboardsBlocked": false,
     "filterOpenInToOnlyManagedApps": false,
     "disableProtectionOfManagedOutboundOpenInData": false,
     "protectInboundDataFromUnknownSources": false,
     "customBrowserProtocol": null,
     "customDialerAppProtocol": null,
     "managedUniversalLinks": [
          "http://*.sharepoint.com/*",
          "http://*.sharepoint-df.com/*",
          "http://*.yammer.com/*",
          "http://*.onedrive.com/*",
          "http://tasks.office.com/*",
          "http://to-do.microsoft.com/sharing*",
          "http://web.microsoftstream.com/video/*",
          "http://msit.microsoftstream.com/video/*",
          "http://*.powerbi.com/*",
          "http://app.powerbi.cn/*",
          "http://app.powerbigov.us/*",
          "http://app.powerbi.de/*",
          "http://*.service-now.com/*",
          "http://*.appsplatform.us/*",
          "http://*.powerapps.cn/*",
          "http://*.powerapps.com/*",
          "http://*.powerapps.us/*",
          "http://*teams.microsoft.com/l/*",
          "http://*devspaces.skype.com/l/*",
          "http://*teams.live.com/l/*",
          "http://*collab.apps.mil/l/*",
          "http://*teams.microsoft.us/l/*",
          "http://*teams-fl.microsoft.com/l/*",
          "http://*.zoom.us/*",
          "http://zoom.us/*",
          "https://*.sharepoint.com/*",
          "https://*.sharepoint-df.com/*",
          "https://*.yammer.com/*",
          "https://*.onedrive.com/*",
          "https://tasks.office.com/*",
          "https://to-do.microsoft.com/sharing*",
          "https://web.microsoftstream.com/video/*",
          "https://msit.microsoftstream.com/video/*",
          "https://*.powerbi.com/*",
          "https://app.powerbi.cn/*",
          "https://app.powerbigov.us/*",
          "https://app.powerbi.de/*",
          "https://*.service-now.com/*",
          "https://*.appsplatform.us/*",
          "https://*.powerapps.cn/*",
          "https://*.powerapps.com/*",
          "https://*.powerapps.us/*",
          "https://*teams.microsoft.com/l/*",
          "https://*devspaces.skype.com/l/*",
          "https://*teams.live.com/l/*",
          "https://*collab.apps.mil/l/*",
          "https://*teams.microsoft.us/l/*",
          "https://*teams-fl.microsoft.com/l/*",
          "https://*.zoom.us/*",
          "https://zoom.us/*"
     ],
     "exemptedUniversalLinks": [
          "http://maps.apple.com",
          "https://maps.apple.com",
          "http://facetime.apple.com",
          "https://facetime.apple.com"
     ],
     "minimumWarningSdkVersion": null,
     "exemptedAppProtocols": [
          {
               "name": "Default",
               "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "sg-Sales and Marketing",
                    "groupType": "StaticMembership"
               }
          }
     ]
}